[{"model": "home.blogs", "pk": 2, "fields": {"title": "<h4 style=\"text-align: center;\"><strong>Your Guide to Investing in Property <span class=\"d-block fw-light\" style=\"color: #00ce8d;\" data-darkreader-inline-color=\"\">That Hasn&rsquo;t Begun Construction</span></strong></h4>\r\n<h4 style=\"text-align: left;\"><strong>&nbsp;</strong></h4>", "content": "<main class=\"container my-5 fs-5\"><main class=\"container my-5 fs-5\">\r\n<p>Even though buying off-the-plan properties is becoming more and more common, it's important to understand the risks associated with them. This blog will explain what makes specific developments more or less risky so that you can decide on an off-plan purchase with greater knowledge.&nbsp;</p>\r\n<p>So, to begin with, should you make an investment in a property where building has not yet begun? &nbsp;</p>\r\n<p>This is defiantly something to explore extensively, that is for sure. Before considering buying an off-plan property, property investors should go through the following checklist of questions and make sure they are familiar with the answers and the overall risk.&nbsp;</p>\r\n<ol>\r\n<li style=\"text-align: left;\"><span data-contrast=\"auto\">Do you have any news regarding the developer?</span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\">&nbsp;</span></li>\r\n<li style=\"text-align: left;\"><span data-contrast=\"auto\">Are they skilled and experienced in the off-plan industry?</span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\">&nbsp;</span></li>\r\n<li style=\"text-align: left;\"><span data-contrast=\"auto\">Are they built to a high standard and are they able to show proof of completed sites?</span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\">&nbsp;</span></li>\r\n<li style=\"text-align: left;\"><span data-contrast=\"auto\">Has construction begun on-site?</span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\">&nbsp;</span></li>\r\n<li style=\"text-align: left;\"><span data-contrast=\"auto\">Have they made extensive plans already?</span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\">&nbsp;</span></li>\r\n<li style=\"text-align: left;\"><span data-contrast=\"auto\">What is the developer's track record?</span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\">&nbsp;</span></li>\r\n<li style=\"text-align: left;\"><span data-contrast=\"auto\">Are they working with credible contractors?</span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\">&nbsp;</span></li>\r\n<li style=\"text-align: left;\"><span data-contrast=\"auto\">Are they funded in advance?</span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\">&nbsp;</span></li>\r\n<li><span data-contrast=\"auto\">Do they have any updates on the construction?</span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\"> <br /></span></li>\r\n</ol>\r\n<div class=\"textBox py-2\">\r\n<p>Following this checklist will help you to gain a wider understanding of the potential risks surrounding off plan property investment. The importance of each of these areas are detrimental to your investment planning. Read more below.</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">Key Phrase Bank</p>\r\n<h6 class=\"fs-5 fw-bold pt-3\">Forward Funding</h6>\r\n<p>means that the development has been funded by professional institutes prior to the build. Highlighting their trust in the constructors and developers, providing a lessened risk factor.</p>\r\n<h6 class=\"fs-5 fw-bold pt-3\">Fractional Funding</h6>\r\n<p>This states that the developer relies on investor deposits to fund the construction and so, set targets will need to be met before construction begins. However, the risk attributed to these surrounds delays due to waiting for targets to be met.</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">Units are sold before the construction is initiated, why?</p>\r\n<p>Before beginning construction on a site, developers occasionally need to sell a particular number of properties. This is frequently the case when a developer uses deposits to pay for the development's construction. These types of developments frequently require the sale of a sizable percentage of the units, and they are frequently heavily incentivised (through furniture packages etc.). In rare circumstances, sites may demand that up to 75% of the units be sold before construction can begin. With reliance's such as these, it becomes evident that delays may arise. Taking into account the worlds current climate and whether targets are met will help predict this also. In more extreme cases this may result in the development not being built at all, this highlighting the risk level of these developments further.</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">The Importance of Planning</p>\r\n<p>Although planning is definitely necessary before starting the approval process for the majority of traditional property investments, it is nevertheless important to ensure that they have the required planning permission also. Planning applications are always accessible to the general public online. Visit the government website and use the 'register of planning decisions' to look up a planning application. You can find out which local council it pertains to and access a connection to their website after entering the correct postcode. You may often search for planning applications and documentation on the council website using the application reference number provided, address, postcode, or even a map. This will enable you to access the application's and decision's details once you have located the relevant application.</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">Constuction has stopped, what steps should I take?</p>\r\n<p>A variety of factors, including a lack of funding, an increase in material costs, and disruptions to supply networks, can cause property developments to be postponed. It's crucial to read the contract's fine print and conditions. A long stop date, which is the agreed-upon deadline for the property to be finished, will typically be written at this point. Buyers who still haven't been able to move into their newly constructed homes after that date might be eligible to receive their deposits back and, if they so want, cancel the contract. For the most part, the best option to get your money returned will need you to see a skilled solicitor. The long stop date may also be extended at your discretion. Sometimes events take place outside of a development's control. A condition for force majeure is applicable in this situation. This provision in a contract modifies the parties' obligations and liabilities in the event of an unforeseen, extraordinary event. Here legal advice is recommended again.</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">LPC&rsquo;s Guide to Identifying Trusted Construction Contractors</p>\r\n<p>If you're thinking about purchasing an off-the-plan property, make sure the construction completed by a reputable contractor. Verify their track record for timely completion of previous developments as well as the construction of high-quality properties. Make sure they are not overly ambitious with time frames and that they have the resources necessary to complete the build. Here at LPC Invest we ONLY work alongside award winning, trusted developers and contractors to provide our investors with as little risk exposure as possible. Following the above checklist will allow for you to ensure the upmost levels of security and achieve peace of mind throughout your property investment journey.</p>\r\n</div>\r\n</main></main>", "desc": "Your Guide to Investing in Property That Hasn’t Begun Construction", "city": "1", "image_1": "media/blogs/iStock-171572347-1-scaled.jpg", "image_2": "media/blogs/modal_image_rxWVYS1.jpg", "pub_date": "2023-01-07"}}, {"model": "home.blogs", "pk": 3, "fields": {"title": "<h4 style=\"text-align: center;\"><strong>Manchester: Still the Perfect Choice for City-Centre Buy-to-Let with <span class=\"d-block fw-light\" style=\"color: #00ce8d;\" data-darkreader-inline-color=\"\">Continued Competition for City Centre Rentals</span></strong></h4>\r\n<h4 style=\"text-align: left;\"><strong>&nbsp;</strong></h4>", "content": "<main class=\"container my-5 fs-5\"><main class=\"container my-5 fs-5\">\r\n<p>In UK cities, more people are looking for rental properties. But more importantly for foreign and expat investors in the UK, the number of rental properties available is not growing. This indicates that prices are increasing, which benefits investors. According to data by Zoopla, there are 43% fewer homes available to rent in cities than there are in suburban areas, even if demand for rental properties in cities is 43% greater than the five-year average. Rents in the city centre have risen to their highest level in 13 years as a result.</p>\r\n<p>The youth population, who are returning to city centres for study and employment as well as for the bustling social scenes centred around bars, clubs, and restaurants, is largely responsible for the increase in demand for rentals in city centres. These younger individuals are living more flexibly and are content to rent despite skyrocketing real estate prices and an increase in the cost of living. Having a property that will meet the needs of this younger population is vital for UK expat and foreign national investors as this will maximise demand, reduce void periods, and maximise.</p>\r\n<div class=\"textBox py-2\">\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">Selecting a City</p>\r\n<p>One of the most crucial choices a UK expat or foreign investor may make in their investment journey is the location of a city centre rental property. Targeting a location with high growth rates, high rent, high rental demand, and reasonable prices will be the best course of action for maximising profitability. Throughout recent history, Manchester has regularly provided this ideal confluence of elements.&nbsp;</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">Manchester is the Centre for Everything&nbsp;</p>\r\n<p>Many investors who are interested in using mortgage solutions for UK expats and foreign nationals frequently choose Manchester as their preferred destination. According to Stuart Marshall, \"Manchester routinely checks those boxes for UK expat and foreign national investors\" on the aspects.</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">Capital Growth</p>\r\n<p>For UK expats and other international investors intending to invest for retirement or other long-term savings goals, a strong capital growth rate is particularly crucial. In the UK, the Northwest is now expected to grow at a rate of 28.8%, followed by Yorkshire and the Humber at 28.2%. The Midlands and Wales are two additional interesting regions, with capital growth rates of 24 and 22.8%, respectively.&nbsp;</p>\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; When evaluating the potential for capital growth of a certain property in a specific location, capital growth history is another useful indication. Manchester is the undisputed leader when looking at the period between 2001 and 2021 due to its 344.59% growth over that time. This greatly surpasses Sheffield, which has a historic capital growth rate of 254.73%, which is the second highest area. If we focus on more recent periods of this time, Liverpool's growth in 2020&ndash;21 surpassed Manchester's growth, with a rate of 17.59% compared to Manchester's figure of 11.4%. However, it is evident that Manchester consistently outperforms the rest in terms of capital growth.</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">Affordability</p>\r\n<p>Affordability is a second consideration alongside capital growth.\" Stuart Marshall keeps on. \"A property is likely to be a wise investment if it is both inexpensive and offers significant potential for capital growth.\" Numerous locations that are mentioned in the subject of capital expansion also come up when it comes to affordability. Investors will find Sheffield, Liverpool, and Newcastle to be extremely affordable, with typical home prices of &pound;191,303, &pound;152,974, and &pound;167,964 correspondingly. In each of these localities, a terraced home costs, on average, &pound;165,911, &pound;133,680, and &pound;164,647. And the average price of a flat in each of these districts is respectively &pound;124,516, &pound;117,946, and &pound;114,252. As a result, these three places are among the most amazingly inexpensive for investors from outside the UK.</p>\r\n<p>The average home cost in Manchester is &pound;199,235. In Manchester, the average price of a semi-detached home is &pound;247,326; a terraced home is &pound;187,376; and a flat is &pound;171,531. These figures are based on more particular types of property. Manchester does present a distinctive investment opportunity due to its capital growth potential and the highly strong demand for real estate in that location, even though its average affordability numbers tend to be higher than those of Sheffield, Liverpool, and Newcastle. &lsquo;According to Stuart Marshall, it can be simple to look at affordability and believe that the more affordable properties will be a better investment. While this is partially true, there are likely other considerations that are more critical when determining the investment's quality. A cheap house is ultimately meaningless if it is not well-liked on the rental market and consequently rented out to tenants. In addition, rent will typically be proportional to the cost of the property, so even while affordability is a barrier to investment, it is not the only consideration. This is especially true when you consider the tremendous variety of mortgage packages for foreigners and UK expats that are available to support investment.&rsquo;&nbsp;</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">Rental Demand &nbsp;</p>\r\n<p>Renter demand is a challenging variable to gauge. &lsquo;The quickest property sales, population growth, the number of property inquiries, and rises in rent and home prices are typically the greatest indications to watch for. In each of these categories, Manchester routinely outperforms the competition. In Manchester, the demand to supply ratio for real estate was determined to be 5:1. Due to the high demand for real estate, investors who want to do so will experience few vacant periods.&rsquo;&nbsp;</p>\r\n<p>Similarly, Manchester has had a staggering 27.8% increase in population since 1991. Additionally, it grew by 7.7% between 2006 and 2016, which is twice the UK's average growth rate. This shows that an increasing number of people are choosing to reside in the city, and the reasons for this become increasingly clearer when considering Manchester's demographics. In Manchester, 37% of people are between the ages of 18 and 34. Given the city's high student population, it is not surprise that young people are attracted to Manchester. Over 100,000 students currently reside in Manchester, and 51% of them decide to stay after graduating. This is a crucial consideration for investors because younger generations are more inclined to rent because they frequently cannot afford to buy their own homes. This is particularly true right now, when housing and living expenses are very expensive. This younger age group is also a very desirable target market for rentals and can be extremely profitable for investors using a mortgage obtained by a UK expat or a foreign national. This understanding of the local population assists in advising international and UK expat investors on the kinds of properties that will appeal to the local market.&nbsp;</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">Rents</p>\r\n<p>The amount of the area's average rent is significant since it clearly determines the rent a landlord may demand for a property. But many of the other characteristics we have just explored are frequently linked to and influenced by rents. Rental demand often determines higher rents because it will constrain supply and put upward pressure on prices. Rental rates frequently increase along with capital growth rates in an area because this generally signals that a location is in demand or \"on the rise.\" Rents in the Northwest climbed by 6.3% between 2020 and 2021, which is partially explained by this symbiotic relationship. Additionally, similar gains in capital growth are anticipated for the Northwest in the future. Rents are likely to continue to rise as well.expenses are very expensive. This younger age group is also a very desirable target market for rentals and can be extremely profitable for investors using a mortgage obtained by a UK expat or a foreign national. This understanding of the local population assists in advising international and UK expat investors on the kinds of properties that will appeal to the local market.</p>\r\n</div>\r\n</main></main>", "desc": "Manchester: Still the Perfect Choice for City-Centre Buy-to-Let with Continued Competition for City Centre Rentals", "city": "4", "image_1": "media/blogs/C02-03_-_Towards_Alexander_Tower_HighRes.jpg", "image_2": "media/blogs/modal_image_C6MC5k9.jpg", "pub_date": "2023-01-07"}}, {"model": "home.blogs", "pk": 4, "fields": {"title": "<h4 style=\"text-align: center;\"><strong>The Post Covid Rental Market Revival is Benefitting the <span class=\"d-block fw-light\" style=\"color: #00ce8d;\" data-darkreader-inline-color=\"\">UK Expat and Foreign National Investors</span></strong></h4>\r\n<h4 style=\"text-align: left;\"><strong>&nbsp;</strong></h4>", "content": "<main class=\"container my-5 fs-5\"><main class=\"container my-5 fs-5\"><main class=\"container my-5 fs-5\">\r\n<p>Rental market rebound is picking up speed now that post-Covid life is well underway, which is good news for UK expat and foreign national investors using UK expat and foreign national mortgages.&nbsp; </p>\r\n</main>\r\n<div class=\"textBox py-2\">\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">What&rsquo;s Happening in the Rental Market?&nbsp;</p>\r\n<p>Stuart Marshall argues that the rental industry is currently booming. \"This is helping UK expat and foreign national mortgage holders make enormous profits.\" There are several causes for this, but one of the primary ones is a discrepancy between the supply and demand for real estate. Zoopla reports that while the supply of available houses is 43% lower than the five-year average, demand is 43% greater. Rent outside of London currently costs an average of &pound;809 per month, which is the highest level in 13 years due to this gap between supply and demand. Additionally, a 4.5% increase in rent is anticipated for 2022.&nbsp;</p>\r\n<p>Stuart Marshall argues that the rental industry is currently booming. \"This is helping UK expat and foreign national mortgage holders make enormous profits.\" There are several causes for this, but one of the primary ones is a discrepancy between the supply and demand for real estate. Zoopla reports that while the supply of available houses is 43% lower than the five-year average, demand is 43% greater. Rent outside of London currently costs an average of &pound;809 per month, which is the highest level in 13 years due to this gap between supply and demand. Additionally, a 4.5% increase in rent is anticipated for 2022.&nbsp;</p>\r\n<p>Even room rents have increased quickly in recent years due to the intense competition for rental properties, jumping 8.4% just in January. The average cost of a room in January 2020 exceeded the pre-pandemic high of &pound;622pcm, which is the fastest growth rate in rooms in the past two years. With fewer rooms available to rent than at this time last year, room rental increase is also anticipated to continue. &lsquo;With such strong rental growth, it&rsquo;s an excellent time to utilise a UK expat or foreign national mortgage to secure a slice of the highly lucrative UK rental market.&rsquo;&nbsp;</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">Restored Rental Markets in the City&nbsp;</p>\r\n<p>The revival of city centre markets is another factor that has a significant impact on the rental market's growth. As workplaces resume some level of normalcy, the transition to post-pandemic life has facilitated travel and restored confidence to many towards city living. As a result, according to Savills, city centre rental prices experienced their highest six-month performance in seven years in the second half of 2021. The demand that developed for rental houses in commuter zones diminished after work and social scenes returned to city centres, which is why major cities are benefiting the most from the increase in rental prices. In consequence, rental increase was 9.7% year over year in inner Manchester, 9.6% in inner Birmingham, and 9.7% in inner Leeds.&nbsp;</p>\r\n<p>\"Rental growth has also been exceptionally strong in the capital, with annual rent rise 10.3% greater than the prior year.\" The significant decline in capital rents during the pandemic and the subsequent rebound in London rentals since the return of office-based working and city living are the main causes of this strong capital rent growth.&nbsp;</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">Rent Growth's Foreseeable Future.</p>\r\n<p>It is within today's society that there is a demand, higher than ever for student properties and temporary accommodation for those traveling due to work. And so, HMOs and Air BnB properties are required. Through the exploration of these avenues, a higher income and yield will become evident for the investor.</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">Reduce the cost of the property relative to the rental revenue.</p>\r\n<p>As always, it's impossible to say for sure how the rental market will behave throughout the remainder of 2022. However, as was already said, a further 4.5% increase in rent is expected in 2022. &lsquo;Rental increase is all but certain if the supply of rental properties in the first half of the year is any indication of trends that will emerge in the second half of the year. In comparison to the normal January 2022 start of the year, there were 39% fewer houses available for rent. This is somewhat attributable to the phenomenal 76% increase in demand, but there has also been a 15% decrease in the flow of new rental housing supply. Due to this circumstance, the rental market is moving quickly; currently, it takes residences 14 days on average to be rented out, as opposed to 21 days towards the end of 2020.&nbsp;</p>\r\n<p>Returns for current UK expat and international mortgage holders will increase as prices soar as a result of demand. Renters now pay an average of &pound;969 per month due to the 76% increase in demand in the New Year that has increased rental prices. When compared to the beginning of the epidemic, this average has increased by &pound;62 per month (or &pound;744 annually), while the final three months of 2021 saw an 8.3% increase. Furthermore, according to property marketplace Zoopla, private tenants now pay 31% of their monthly household income for rent. Owner-occupiers spend only 18% of their monthly income on housing, in contrast.&nbsp;</p>\r\n<p>&lsquo;Given the data we currently have, it seems likely that 2022 will remain to be a very profitable year for those with UK expat or foreign national mortgages who own rental properties in the UK.&rsquo;&nbsp;</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">The Results</p>\r\n<p>\"Now is a perfect time to get a mortgage from a UK expat or foreign national to buy an investment property in the UK.\" Because there is such a strong demand and a small supply, current investors are earning tremendous profits. There are several UK expat and foreign national mortgages available for potential investors to take advantage of the current circumstances. Due to the state of the business, there is also little competition from domestic investors. Rising prices, interest rates, and harsher laws have all contributed to a decline in domestic investor confidence. Many domestic investors are not equipped to ensure that their properties are up to code in a risky environment where mortgage rates are likely to climb, and the cost of living is rising because of the impending regulations around EPC ratings.&rdquo;&nbsp;</p>\r\n<p>The effect that rising rents will have on the capital value of properties is another reason to invest right now. In 2022, house prices rose at their quickest rate in January in 17 years, according to Nationwide, which reported an 11.2% year-over-year increase.&nbsp;</p>\r\n<p>'In short, UK expat and foreign national landlords are likely to witness quick lets, decreased vacant periods, and high demand for the suitable property due to the present market conditions. For those investing with a UK expat or foreign national mortgage, 2022 will only see greater rental growth as a result of people returning to their jobs and schools and the relaxation of travel restrictions.&rsquo;</p>\r\n</div>\r\n</main></main>", "desc": "The Post Covid Rental Market Revival is Benefitting the UK Expat and Foreign National Investors", "city": "1", "image_1": "media/blogs/BUILDING.jpg", "image_2": "media/blogs/modal_image_lRz3Tlf.jpg", "pub_date": "2023-01-09"}}, {"model": "home.blogs", "pk": 5, "fields": {"title": "<h4 style=\"text-align: center;\"><strong>Why Preston is emerging as the <span class=\"d-block fw-light\" style=\"color: #00ce8d;\" data-darkreader-inline-color=\"\">Investment hotspot of the Northwest</span></strong></h4>\r\n<h4 style=\"text-align: left;\"><strong>&nbsp;</strong></h4>", "content": "<main class=\"container my-5 fs-5\"><main class=\"container my-5 fs-5\">\r\n<p>Preston is one of the up-and-coming hotspots of the north. Branded as &lsquo;the next best thing&rsquo;, Preston has grown within its value to potential property investors as it has been named as the best small city for property investors and landlords in the UK.&nbsp; The change in recent years has allowed for Preston to become one of the top places to live and work in the northwest of England. This partnered with the 15 year, Stoneygate Materplan for regeneration creates the platform for a bright and exciting future for Preston. &nbsp;</p>\r\n<p>The city has been crowned as a prime location for growing and established companies due to the outlined regeneration and the city also being a hub for entrepreneurial businesses. Preston is already home to companies such as Jaguar Land-Rover and BAE Military Air Solutions, with this predicted to only grow further. &nbsp;</p>\r\n<p>The city boasts a booming economy, fantastic lifestyle, and a higher education sector. This all falling into line with the city&rsquo;s 26% growth in employment over the decade to 2020, which is 3 times the national average during this period. &nbsp;</p>\r\n<p>With more than 36% of Preston&rsquo;s population being over 25, the demand for more luxury style living is ever growing. This mainly being attributed to by the 38,000 people studying and working at the Preston based University of Central Lancashire (UCLan). Highlighting how the short-term-let market is valuable here due to the constant need for student accommodation.&nbsp;</p>\r\n<p>The arrival of new developments across the city and further, the introduction of HS2 in the future to nearby Manchester, will allow for an easier travel route from the busy south all the way up north. The future holds a large scale of promise for locations such as Preston making the best time to invest, now.</p>\r\n</main></main>", "desc": "Why Preston is emerging as the Investment hotspot of the Northwest", "city": "9", "image_1": "media/blogs/05-Aquitania-Waterfront.jpg", "image_2": "media/blogs/modal_image_4PBiydH.jpg", "pub_date": "2023-01-09"}}, {"model": "home.blogs", "pk": 6, "fields": {"title": "<h4 style=\"text-align: center;\"><strong>Digbeth: Your Guide to a <span class=\"d-block fw-light\" style=\"color: #00ce8d;\" data-darkreader-inline-color=\"\">City on the Rise<br /></span></strong></h4>", "content": "<main class=\"container my-5 fs-5\"><main class=\"container my-5 fs-5\">\r\n<p>Following the submission of plans for the thorough renovation of the region, Digbeth may undergo a transformation over the course of the next 15 years.&nbsp;</p>\r\n<p>The ideas, which will be discussed by the council's planning committee, include apartments, nightclubs, student housing, and even a \"sky park\". What would the ideas involve, and what would they signify for the region? Here, we have chosen five news headlines</p>\r\n<div class=\"textBox py-2\">\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">The 15 Year Timetable&nbsp;</p>\r\n<p>Although 2035 may seem in the distant future, this is the deadline that the developers have set for finishing the entire project.&nbsp;</p>\r\n<p>The construction is to start later this year. According to documents from the proposals, \"The assessment of the proposed development has been appraised as a \"whole,\" which would start in 2021 and be fully operational by 2035 if realised.\"</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">59 Buildings to be Demolished&nbsp;</p>\r\n<p>The developer's plans encompass the majority of Digbeth, and it is anticipated that several nearby buildings will need to be demolished in order to make room for 2,000 houses, a nightclub, restaurants, and bars, to name just a few.&nbsp;</p>\r\n<p>According to documents, \"approximately 59 structures would be demolished within the property and replaced with the increased floorspace.\"&nbsp;</p>\r\n<p>Many of the locally listed structures on the property are also expected to remain, along with all the nationally listed buildings, with some modifications.&nbsp;</p>\r\n<p>However, a number of the structures along Floodgate Street, Liverpool Street, Heath Mill Lane, and many other streets appear destined for demolition, with several of those structures&mdash;including the Teamworks Carting building&mdash;currently housing businesses.</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">Sky Park&nbsp;</p>\r\n<p>If the plans are implemented, Duddeston Viaduct, a long-disused Victorian viaduct in the heart of the city, might potentially receive a significant refurbishment.&nbsp;</p>\r\n<p>According to planners, the viaduct's transformation has been one of the development's primary driving forces. They made plans that were comparable to those implemented on New York's High Line, a little-known, long-abandoned elevated train that has been converted into a public park and playground. Just like that of the Castlefield Viaduct in Manchester.&nbsp;</p>\r\n<p>As stated in the HS2 Curzon Masterplan, \"There is a chance to build a lively public space that would be beneficial not only to the current business and residential community within the application site, but also to the remainder of the City Centre, wider Birmingham, and the West Midlands.&rdquo;</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">New Jobs&nbsp;</p>\r\n<p>If approved, the renovation of Digbeth would rank among the largest initiatives ever attempted in the city, including the construction of new residences, businesses, eateries, caf&eacute;s, and recreational facilities.&nbsp;</p>\r\n<p>Additionally, the project's developers, Oval Real Estate, claim that the project will generate 16,000 new jobs, resulting in thousands of new jobs for local Britons.&nbsp;</p>\r\n<p>James Craig, the company's founder, commented on the project, saying: \"We have been talking about these plans with the city council and a lot of other local stakeholders for a number of years and we are pleased to be nearing the next step of our plans.&rdquo;</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">Custard Factory Revamp&nbsp;</p>\r\n<p>Plans to renovate the renowned Custard Factory, one of Digbeth's most recognisable structures, are among the redevelopment scheme's most prominent suggestions.&nbsp;</p>\r\n<p><strong>The initial plans call for a three-story rooftop addition to the Custard Factory, which architects claim will be situated at the \"centre\" of the new construction. This is the only portion of the application that is now fully detailed. A seven-story, 40-apartment residential complex with the moniker \"Custard Factory Living\" is also included in the plans. </strong></p>\r\n</div>\r\n</main></main><main class=\"container my-5 fs-5\">\r\n<article>\r\n<div class=\"textBox py-2\">\r\n<p>&nbsp;</p>\r\n</div>\r\n<div class=\"textBox py-2\">\r\n<h4 class=\"display-6 fw-bold\">&nbsp;</h4>\r\n<p>&nbsp;</p>\r\n</div>\r\n<h4 class=\"display-6 fw-bold\">&nbsp;</h4>\r\n<p>&nbsp;</p>\r\n<h4 class=\"display-6 fw-bold\">&nbsp;</h4>\r\n<p>&nbsp;</p>\r\n<p>Here at LPC Invest we hold exclusive access to the Digbeth Lofts development, with only 20 units remaining we urge you to contact us today to find out more.</p>\r\n</article>\r\n</main>", "desc": "Digbeth: Your Guide to a City on the Rise", "city": "2", "image_1": "media/blogs/04-Aquitania-CulturePark-Corner-4thFloor.jpg", "image_2": "media/blogs/modal_image_wgRHELj.jpg", "pub_date": "2023-01-09"}}, {"model": "home.blogs", "pk": 7, "fields": {"title": "<h4 style=\"text-align: center;\"><strong>Your Guide To Buy-To-Let Properties <span class=\"d-block fw-light\" style=\"color: #00ce8d;\" data-darkreader-inline-color=\"\">Buy-To-Let Properties</span></strong></h4>\r\n<h4 style=\"text-align: left;\"><strong>&nbsp;</strong></h4>", "content": "<main class=\"container my-5 fs-5\">\r\n<p>As the demand for tenants increases, the buy-to-let sector of the real estate market has been consistently rising, giving investors seeking a medium-to long-term investment more traction. A person or business buying a property with the goal to \"lease\" it to renters is what is meant by the term \"buy-to-let.\" Due to the expensive entrance barrier and high deposits, purchasing a house might be difficult for first-time buyers who are trying to climb the property ladder. Meaning that we live in a society where many millennials will likely continue to rent into their forties. A lot of people think they'll be drawing from their pensions before they even think about buying.&nbsp;</p>\r\n<p>In this area, real estate costs are frequently very high, but renting becomes an economical living choice for people who want to live close to their place of employment. Renting has now become a convenience for a large percentage of the population. According to Statista, the largest rental demographic in the UK in 2020 was tenants between the ages of 25 and 34. Despite a rise in homeowners in every age group, there were 1.4 million private renters overall.</p>\r\n<p class=\"container my-5 fs-5\"><strong>What are the benefits of buy-to-let real property &amp; why should you still invest?&nbsp;</strong></p>\r\n<div class=\"textBox py-2\">\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">The provider of regular income</p>\r\n<p>Rental payments are normally sent to landlords every month. This enables them to settle any outstanding obligation on the house, including any mortgage payments. Rent payments may also contribute to the cost of any repairs, such as wear and tear, that the property requires. In addition, landlords typically account for a profit to make the venture feasible.</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">The advantages of HMOs&nbsp;</p>\r\n<p>HMOs, often known as houses in multiple occupancy, are a type of buy-to-let property. A rental yield from an HMO might be up to three times higher for landlords than a single lease for the entire property. They might, however, necessitate significant long-term maintenance expenses.</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">Capital Growth &nbsp;</p>\r\n<p>Owning a buy-to-let property means the landlord's asset may appreciate in value over the long run-in conjunction with rises in the national housing market. If the landlord decides to sell the house, its market worth may be far more than when it was first bought. Consequently, this causes a rise in capital growth.</p>\r\n</div>\r\n</main>", "desc": "Your Guide To Buy-To-Let Properties Buy-To-Let Properties", "city": "1", "image_1": "media/blogs/2.1.jpg", "image_2": "media/blogs/modal_image_fXD0eQr.jpg", "pub_date": "2023-01-09"}}, {"model": "home.blogs", "pk": 8, "fields": {"title": "<h4 style=\"text-align: center;\"><strong>Yields &amp; <span class=\"d-block fw-light\" style=\"color: #00ce8d;\" data-darkreader-inline-color=\"\">Rerturns Article</span></strong></h4>\r\n<h4 style=\"text-align: left;\"><strong>&nbsp;</strong></h4>", "content": "<main class=\"container my-5 fs-5\">\r\n<p>The annual rental income, as a percentage of the property's purchase price, is what a real estate investor refers to as the rental yield. It is a particularly helpful metric when evaluating various properties in your portfolio, with property owners finding it to be a valuable benchmark for planning future investments.&nbsp;</p>\r\n<p>There are two methods for determining yield. Gross yield is a straightforward calculation that compares the value of the property at the time of purchase to the typical rent collected.</p>\r\n<p>Here a LPC Invest we have compiled our top 5 tips for boosting your rental yield. Following such tips will help you understand the true yield and further, maximise this.&nbsp;</p>\r\n<div class=\"textBox py-2\">\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">Smart Investment.</p>\r\n<p>A variety of factors, including a lack of funding, an increase in material costs, and disruptions to supply networks, can cause property developments to be postponed. It's crucial to read the contract's fine Property investing needs extensive research, a lot of effort, and commitment. You will gain experience and be better prepared for the subsequent purchase with each new investment you make. To maximise your return, it is crucial to approach each new property as a business choice, thoroughly evaluating each potential investment and engaging in negotiation when appropriate.</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">Make the property desirable to tenants/renters.</p>\r\n<p>Reducing the number of times, you have to find new tenants is one of the best methods to maximise your return because increased wear and tear, void periods, and marketing expenses may all affect the overall yield. In order to ensure they remain longer and respect your investment like their own home, treat tenants like valued customers and provide them with a first-class moving-in and living experience.</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">Switch to a higher cash-flowing approach</p>\r\n<p>It is within today's society that there is a demand, higher than ever for student properties and temporary accommodation for those traveling due to work. And so, HMOs and Air BnB properties are required. Through the exploration of these avenues, a higher income and yield will become evident for the investor.</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">Reduce the cost of the property relative to the rental revenue.</p>\r\n<p>HMOs are more profitable than standard buy-to-let properties as they allow for income to be generated from multiple streams. This also is reflected by that of AirBnBs as you can rent out entire properties or individual rooms through the mere download and set up of an application.</p>\r\n<p class=\"display-6 fw-bold\" style=\"font-size: 22px!important;\">The Importance of Planning</p>\r\n<p>Although planning is definitely necessary before starting the approval process for the majority of traditional property investments, it is nevertheless important to ensure that they have the required planning permission also. Planning applications are always accessible to the general public online. Visit the government website and use the 'register of planning decisions' to look up a planning application. You can find out which local council it pertains to and access a connection to their website after entering the correct postcode. You may often search for planning applications and documentation on the council website using the application reference number provided, address, postcode, or even a map. This will enable you to access the application's and decision's details once you have located the relevant application.</p>\r\n</div>\r\n</main>", "desc": "Yields & Rerturns Article", "city": "5", "image_1": "media/blogs/1._Bradford_Front_Exterior.jpg", "image_2": "media/blogs/modal_image_MSTlxox.jpg", "pub_date": "2023-01-09"}}, {"model": "home.blogs", "pk": 9, "fields": {"title": "<h4 style=\"text-align: center;\"><strong>MediaCityUK, The home of entertainment &amp; <span class=\"d-block fw-light\" style=\"color: #00ce8d;\" data-darkreader-inline-color=\"\">The future home of investment<br /></span></strong></h4>\r\n<h4 style=\"text-align: left;\"><strong>&nbsp;</strong></h4>", "content": "<main class=\"container my-5 fs-5\">\r\n<p>MediaCityUK, a well-known Salford Quays redevelopment project that is already regarded as one of the UK's most remarkable urban regeneration projects, is quickly changing and moving even further forward. One of the most notable commercial developments in the nation and a popular location for living and learning, MediaCityUK's Manchester Docks development landed here in 2012.&nbsp;</p>\r\n<p>A &pound;1 billion, ten-year proposal for the area was announced by MediaCityUK a few years later in 2016. After a couple of years, these plans are well under way, and as part of the expansion, the digital and media hub is scheduled to increase incredibly in size. It is evidential that MediaCityUK will continue to see huge development in the years to come.&nbsp;</p>\r\n<p>MediaCityUK, which soon transformed into a hub of media innovation, had a significant impact on Salford Quays' development prior to regeneration. Salford Quays has developed into a hotspot for property investment in the UK because of the area's strength, and it offers exceptional rental yields of a calibre that buy-to-let investors could only have imagined decades ago.&nbsp;</p>\r\n<p>A focus on improving what's currently in place by expanding the Salford regeneration scheme further is one of the additional proposals for the rebuilding of MediaCityUK. This will include welcoming ten additional structures with unique designs, around 2,000 flats, up to 540,000 additional square feet of top-notch office space, and more retail and leisure amenities.&nbsp;</p>\r\n<p>Construction of MediaCityUK, under the direction of the Peel Group, started back in 2007. This marked the beginning of a new Salford Quays and said goodbye to the section of Salford Quays that was once abandoned before its improvement. Since then, Salford, which is located in Manchester, has developed into a recognised centre for commerce and investment. The Northern headquarters of the BBC, together with offices for ITV, Ericsson, Kellogg's, and 250 other companies, are all located at MediaCityUK.&nbsp;</p>\r\n<p>Young professionals and recent graduates are opting to move to MediaCityUK since it has such a strong business pull in order to find their next rental home. This fact is helped by the student retention rate of the city standing at just over 50%. Manchester is more desirable than other urban areas due to its growing population and reasonable housing costs. Manchester and Salford have earned the top spot for UK real estate investment for the next ten years, and more regeneration in these cities is on the horizon.&nbsp;</p>\r\n<p>Here at LPC Invest, we hold access to properties across MediaCityUK such as X1 Michigan Towers. Contact us today to discuss the prospects that MediaCityUK has to offer and how you can invest in those.</p>\r\n</main>", "desc": "MediaCityUK, The home of entertainment & the future home of investment", "city": "4", "image_1": "media/blogs/3.jpg", "image_2": "media/blogs/modal_image_wiW5jpz.jpg", "pub_date": "2023-01-09"}}, {"model": "home.blogs", "pk": 10, "fields": {"title": "<h4 style=\"text-align: center;\"><strong>The Games Might Be Over, <span class=\"d-block fw-light\" style=\"color: #00ce8d;\" data-darkreader-inline-color=\"\">But The Potential Is Not</span></strong></h4>\r\n<h4 style=\"text-align: left;\"><strong>&nbsp;</strong></h4>", "content": "<main class=\"container my-5 fs-5\">\r\n<p>The arrival of The Commonwealth Games has dominated the tabloids over the past year or so, drawing a large spotlight onto the city of Birmingham. However, in the shadows, the city has been experiencing incredible growth which, in turn, is pulling a large percentage of property investors to its centre.&nbsp;</p>\r\n<p>Just like the 10-meter mechanical bull that stormed the stadium at Birmingham&rsquo;s Commonwealth games, the property market is about to make a huge and exponential relaunch into the city.&nbsp;</p>\r\n<p>With Birmingham following in the footsteps of other UK giants such as Manchester and London, the property market is growing incredibly in its value. The outstanding fact that surrounds that of Birmingham is that the prices of properties in the city are 60% lower than those found within the capital of London. This again highlights the future potential for Birmingham&rsquo;s property market and how now is the best time to invest in the city. Birmingham ranks as one of the most popular investment locations in Europe and with the city hosting world-renowned events such as The Commonwealth Games, this is only predicted to grow and grow. &nbsp;</p>\r\n<p>The city is host to a huge regeneration that is ongoing throughout its regions. The Big City Plan is highly ambitious for Birmingham and highlights the future projection for the city through a 20-year &lsquo;masterplan&rsquo;. The plan will be seen to contribute &pound;2.1billion to the economy each year, with the council focusing on the enhancement of the city&rsquo;s offerings through this. Whilst aiming to provide a well-connected, efficient, and walkable city centre. This plan is already well underway since its ignition in 2010, with the city already starting to reap its benefits.&nbsp;</p>\r\n<p>The Commonwealth Games merely acted as an addition to the thriving culture already present throughout Birmingham. The games provided the city with a huge &pound;778million investment which has been pumped into the city and its regions. This investment has allowed for huge improvements to the city and notable amenities, such as The Alexander Stadium and The Sandwell Aquatics Centre. Which combined have received a &pound;130million revitalisation. This all falls alongside the BBC hub found in Digbeth and the eventual arrival of HS2 to Solihull, as the city is becoming a hotspot for employment and travel. &nbsp;</p>\r\n<p>The city itself is home to five universities, producing 80,000 graduates each year. The student retention rate falling just under 50% highlights how valuable the Buy-to-Let market is here. This partnered with the city being one of the best homes for setting up start-up businesses, not only promoting the appeal of the city, as 18,394 new enterprises were found in the city as of 2020. But, displays the huge potential present here. Upon the arrival of HS2, Birmingham will fall a mere 52-minute train journey from the UK&rsquo;s business hotspot of London. Thus, allowing for a greater level of connectivity for business professionals and the ability to live outside the capital beyond the restraints of travel. &nbsp;</p>\r\n<p>The Birmingham property market is one of the most affordable in the UK relative to its size. The average property price in Birmingham is &pound;229,334, attracting more and more investors to the Buy-to-Let market found there. This also means that Birmingham&rsquo;s rental yields are notable, especially when considering the recent rental growth due to the increased inflation rates. The yields presented by Birmingham are considerably higher than those found in the South. &nbsp;</p>\r\n<p>The city is a hub for growth and arguably the backdrop for huge opportunities. Here at LPC Invest, we hold access to properties within the new City Green development in Birmingham. Contact us today to discuss the prospects that Preston has to offer and how you can invest in this. &nbsp;</p>\r\n</main>", "desc": "The Games Might Be Over, But The Potential Is Not", "city": "1", "image_1": "media/blogs/2.jpg", "image_2": "media/blogs/modal_image_O5HowBN.jpg", "pub_date": "2023-01-09"}}, {"model": "home.blogs", "pk": 11, "fields": {"title": "<h4 style=\"text-align: center;\"><strong>What would you do with &pound;100k?, <span class=\"d-block fw-light\" style=\"color: #00ce8d;\" data-darkreader-inline-color=\"\">Not your average question, not your average answer</span></strong></h4>\r\n<h4 style=\"text-align: left;\"><strong>&nbsp;</strong></h4>", "content": "<main class=\"container my-5 fs-5\">\r\n<p>I am The world is in an ever-changing state and the predictability of this is uncertain. We cannot simply ignore these facts and continue as we are. Learning and keeping up to date with the worlds current situation is essential and we here at LPC Invest want to help with this.</p>\r\n<p>I am more than certain that you will have heard the words &lsquo;inflation&rsquo; and &lsquo;interest rates&rsquo; being thrown around a staggering amount during the past year. Inflation is at an all-time high and we are starting to hear more and more concern surrounding this topic from our clients on the opposite end of the LPC phones. As humans, we are seen to run from any form of risk when concerning money during these periods of economic struggle. However, it is during these times that we must do the COMPLETE opposite. &nbsp;</p>\r\n<p>It is during times of high inflation that the money you have sitting in the bank starts to become worth less and less each month, so the appeal of generating income through investment becomes more and more appealing to said individual. &nbsp;</p>\r\n<p>The demand for property is growing, this being highlighted by the recently published 2021 census as the population is seeing an astronomical increase. Proving that inner city investment is something to capitalise upon, especially during this time of ever-present change. The growth in demand is linked directly to the increase in rents for landlords, highlighting how important it is to invest now and avoid joining the market when this has increased even further. &nbsp;</p>\r\n<p>Contrary to popular belief property is not a &lsquo;get rich quick&rsquo; domain and if that is the stance you take, you are in the wrong place. Property investment is a long-term game, something that cannot be rushed or materialise overnight. If you have crafted your game plan surrounding your properties, the happenings of the next month or year are impertinent. The time to invest is always now as you never know what the future holds.&nbsp;</p>\r\n<p>We must embrace this uncertainty and take the risks others are not in order to reap the benefits in order to see the biggest wins. We are here at LPC Invest to share our knowledge and guide you through your investment journey. Contact us today with your queries, we are always happy to help.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n</main>", "desc": "What would you do with £100k?  Not your average question, not your average answer", "city": "1", "image_1": "media/blogs/liverpool.jpeg", "image_2": "media/blogs/modal_image_xmuQSbr.jpg", "pub_date": "2023-01-09"}}, {"model": "home.blogs", "pk": 12, "fields": {"title": "<h2 class=\"heading fs-1 pt-5 text-capitalize\"><span style=\"color: #00ce8d;\">5</span> Places to invest in property <span class=\"d-block\" style=\"color: #00ce8d;\">during the Cost of Living Crisis</span></h2>", "content": "<h2 class=\"heading fs-1 pt-5 text-capitalize\"><span style=\"color: #00ce8d;\">5</span> Places to invest in property <span class=\"d-block\" style=\"color: #00ce8d;\">during the Cost of Living Crisis</span></h2>\r\n<h2 class=\"heading fs-1 pt-5 text-capitalize\"><span style=\"color: #00ce8d;\">5</span> Places to invest in property <span class=\"d-block\" style=\"color: #00ce8d;\">during the Cost of Living Crisis</span></h2>\r\n<h2 class=\"heading fs-1 pt-5 text-capitalize\"><span style=\"color: #00ce8d;\">5</span> Places to invest in property <span class=\"d-block\" style=\"color: #00ce8d;\">during the Cost of Living Crisis</span></h2>\r\n<h2 class=\"heading fs-1 pt-5 text-capitalize\"><span style=\"color: #00ce8d;\">5</span> Places to invest in property <span class=\"d-block\" style=\"color: #00ce8d;\">during the Cost of Living Crisis</span></h2>\r\n<h2 class=\"heading fs-1 pt-5 text-capitalize\"><span style=\"color: #00ce8d;\">5</span> Places to invest in property <span class=\"d-block\" style=\"color: #00ce8d;\">during the Cost of Living Crisis</span></h2>\r\n<h2 class=\"heading fs-1 pt-5 text-capitalize\"><span style=\"color: #00ce8d;\">5</span> Places to invest in property <span class=\"d-block\" style=\"color: #00ce8d;\">during the Cost of Living Crisis</span></h2>\r\n<h2 class=\"heading fs-1 pt-5 text-capitalize\"><span style=\"color: #00ce8d;\">5</span> Places to invest in property <span class=\"d-block\" style=\"color: #00ce8d;\">during the Cost of Living Crisis</span></h2>\r\n<h2 class=\"heading fs-1 pt-5 text-capitalize\"><span style=\"color: #00ce8d;\">5</span> Places to invest in property <span class=\"d-block\" style=\"color: #00ce8d;\">during the Cost of Living Crisis</span></h2>\r\n<h2 class=\"heading fs-1 pt-5 text-capitalize\"><span style=\"color: #00ce8d;\">5</span> Places to invest in property <span class=\"d-block\" style=\"color: #00ce8d;\">during the Cost of Living Crisis</span></h2>\r\n<h2 class=\"heading fs-1 pt-5 text-capitalize\"><span style=\"color: #00ce8d;\">5</span> Places to invest in property <span class=\"d-block\" style=\"color: #00ce8d;\">during the Cost of Living Crisis</span></h2>\r\n<h2 class=\"heading fs-1 pt-5 text-capitalize\"><span style=\"color: #00ce8d;\">5</span> Places to invest in property <span class=\"d-block\" style=\"color: #00ce8d;\">during the Cost of Living Crisis</span></h2>\r\n<h2 class=\"heading fs-1 pt-5 text-capitalize\"><span style=\"color: #00ce8d;\">5</span> Places to invest in property <span class=\"d-block\" style=\"color: #00ce8d;\">during the Cost of Living Crisis</span></h2>\r\n<h2 class=\"heading fs-1 pt-5 text-capitalize\"><span style=\"color: #00ce8d;\">5</span> Places to invest in property <span class=\"d-block\" style=\"color: #00ce8d;\">during the Cost of Living Crisis</span></h2>\r\n<h2 class=\"heading fs-1 pt-5 text-capitalize\"><span style=\"color: #00ce8d;\">5</span> Places to invest in property <span class=\"d-block\" style=\"color: #00ce8d;\">during the Cost of Living Crisis</span></h2>\r\n<h2 class=\"heading fs-1 pt-5 text-capitalize\"><span style=\"color: #00ce8d;\">5</span> Places to invest in property <span class=\"d-block\" style=\"color: #00ce8d;\">during the Cost of Living Crisis</span></h2>\r\n<h2 class=\"heading fs-1 pt-5 text-capitalize\"><span style=\"color: #00ce8d;\">5</span> Places to invest in property <span class=\"d-block\" style=\"color: #00ce8d;\">during the Cost of Living Crisis</span></h2>\r\n<h2 class=\"heading fs-1 pt-5 text-capitalize\"><span style=\"color: #00ce8d;\">5</span> Places to invest in property <span class=\"d-block\" style=\"color: #00ce8d;\">during the Cost of Living Crisis</span></h2>\r\n<h2 class=\"heading fs-1 pt-5 text-capitalize\"><span style=\"color: #00ce8d;\">5</span> Places to invest in property <span class=\"d-block\" style=\"color: #00ce8d;\">during the Cost of Living Crisis</span></h2>\r\n<h2 class=\"heading fs-1 pt-5 text-capitalize\"><span style=\"color: #00ce8d;\">5</span> Places to invest in property <span class=\"d-block\" style=\"color: #00ce8d;\">during the Cost of Living Crisis</span></h2>\r\n<h2 class=\"heading fs-1 pt-5 text-capitalize\"><span style=\"color: #00ce8d;\">5</span> Places to invest in property <span class=\"d-block\" style=\"color: #00ce8d;\">during the Cost of Living Crisis</span></h2>", "desc": "5 Places to invest in property during the Cost of Living Crisis", "city": "4", "image_1": "media/blogs/Urban_Green_-_Roof_Terrace_GzY5oQD.jpg", "image_2": "media/blogs/resident_area_tKvcOTm_7OG0qLu.jpg", "pub_date": "2023-02-22"}}]