[{"model": "home.teammembers", "pk": 1, "fields": {"image": "media/team/RYAN_GRIFFITHS_-_PROPERTY_SALES_CONSULTANT.jpg", "name": "Ryan griffiths", "role": "Property Investment Consultan", "desc": "As a true character, Ryan Griffiths cultivates fantastic professional relationships both on and off the phone with all his clients. In addition to supporting all of his clients from start to finish, Ryan continues his relationship with them beyond the handover of keys. As he reaches his 2nd anniversary here at LPC, he can be seen to have accumulated a great deal of knowledge that makes him one of the best sales consultants around.", "mobile": "07456 823 143", "email": "ryan.griffiths@lpcinvest.com", "address": "Arrive white, media city UK, m50 2nt."}}, {"model": "home.teammembers", "pk": 2, "fields": {"image": "media/team/NATALIE_DICKINSON_-_PROPERTY_SALES_CONSULTANT_.jpg", "name": "Natalie dickinson", "role": "Property Sales Consultant", "desc": "Natalie Dickinson's enthusiasm and motivation make her an outstanding addition to the LPC office; she is a people person who is always willing to do whatever it takes to help. She is dedicated to providing a first-class service to all of her clients. Her passion for achieving a successful outcome for her clients is matched by her incredible attention to detail. This is how she succeeds and inspires the rest of the LPC team.", "mobile": "07462 093 816", "email": "natalie.dickinson@lpcinvest.com", "address": "Arrive white, media city UK, m50 2nt."}}, {"model": "home.teammembers", "pk": 3, "fields": {"image": "media/team/BEN_JOHNSON_-_PROPERTY_SALES_CONSULTANT.jpg", "name": "Ben johnson", "role": "Property Sales Consultant", "desc": "The background he has in customer service allows Ben Johnson to handle any property investment issue with the utmost professionalism. Ben is an extremely hard-working and client-focused property investment consultant here at LPC. The passion that Ben has for the property sector allows him to develop a deeper understanding of its entirety and offer the best opportunities to his clients.", "mobile": "07462 081 649", "email": "ben.johnson@lpcinvest.com", "address": "Arrive white, media city UK, m50 2nt."}}, {"model": "home.teammembers", "pk": 4, "fields": {"image": "media/team/AVERIL_RHEAD_-_PROPERTY_SALES_CONSULTANT_.jpg", "name": "Averil rhead", "role": "Property Sales Consultant", "desc": "With three years of experience and a great passion for the property sector, Averil Rheed joined the LPC Invest team back in October 2022. She has worked within North-West property in the past, making her a specialist in this field. Her knowledge of the local market is incredibly valuable and plentiful in her constant efforts to stay abreast of the world's current climate.", "mobile": "07456 805930", "email": "averil.rhead@lpcinvest.com", "address": "Arrive white, media city UK, m50 2nt."}}, {"model": "home.teammembers", "pk": 11, "fields": {"image": "media/team/MARIA_VITTORIA_CATAMO_-_HEAD_OF_MARKETING_YvkXSgi.jpg", "name": "Maria vittoria catamo", "role": "Head of Marketing", "desc": "Leading the new marketing department at LPC, Maria Vittoria Catamo brings a wealth of knowledge and experience to her area of expertise. With 12+ years of experience in the digital world, and repeated experience indirectly managing teams across numerous projects, she now enjoys crafting unique campaigns that help guide our clients to their perfect investment. As our fluent Italian-speaking Head of Marketing, Maria is a valid credit to the LPC team and has already made such an impact.", "mobile": ".", "email": "maria.vittoriacatamo@lpcinvest.com", "address": "Arrive, White Media City UK, Salford, M50 2NT"}}, {"model": "home.teammembers", "pk": 12, "fields": {"image": "media/team/GEORGIA_EVISON.jpg", "name": "Georgia evison-castaldo", "role": "Marketing Executive", "desc": "Georgia Evison is our Marketing Executive here at LPC Invest. After graduating from The University of Salford in 2021, she arrived with a plethora of new knowledge and skills to the team. Working alongside Maria, they form the team behind all LPC campaigns and creative content.", "mobile": "0161 713 3883", "email": "georgia.evison@lpcinvest.com", "address": "Arrive, White Media City UK, Salford, M50 2NT"}}, {"model": "home.teammembers", "pk": 13, "fields": {"image": "media/team/JENNIFER_IFTAKAR_-_HEAD_OF_STRATEGIC_PARTNERSHIPS.jpg", "name": "Jennifer iftakhar", "role": "Head of Strategic Partnerships", "desc": "In addition to providing developers with an experience unlike any other, Jennifer Iftakhar combines her passion for property investment with her exceptional skill set. Jennifer has cultivated amazing professional relationships with those she works with. All whilst cultivating our Reeds Rains partnership. Jennifer has been an integral part of our company's success since her joining in July of 2022.", "mobile": ".", "email": "jennifer.iftakhar@lpcinvest.com", "address": "Arrive, White Media City UK, Salford, M50 2NT"}}, {"model": "home.teammembers", "pk": 14, "fields": {"image": "media/team/Screenshot_2023-01-02_160026_xgCkgmV.jpg", "name": "Stephen bryne", "role": "Head of Sales", "desc": "As Head of Sales at LPC Invest, Steve brings a unique skill set to the company, a huge advantage accoladed to his 16+ years of experience in the field. It is as Head of Sales, that he ensures the smooth running of the day-to-day activities at LPC, keeping the team in good spirits no matter what. His clients in the UK and overseas have come to expect and further, receive a high level of service from Steve and his team.", "mobile": ".", "email": "stephen .bryne@lpcinvest.com", "address": "Arrive, White Media City UK, Salford, M50 2NT"}}, {"model": "home.teammembers", "pk": 15, "fields": {"image": "media/team/KERRY_PENDER_-_HEAD_OF_OPERATIONS.jpg", "name": "Kerry pender", "role": "Head of Operations", "desc": "Kerry Pender is our resident qualified Management Accountant, with her role surrounding the financial sphere, she really is the operations pillar here at LPC Invest. Dedicated, warm, and able to relate to all clients, Kerry's role in property investment is very well-suited and we are incredibly lucky to have her on the team. As our Head of Operations, she is a genuine people person and supports our clients beyond the handing over of their keys.", "mobile": ".", "email": "kerry.pender@lpcinvest.com", "address": "Arrive, White Media City UK, Salford, M50 2NT"}}, {"model": "home.teammembers", "pk": 16, "fields": {"image": "media/team/LEE_CHETTOE_-_MANAGING_DIRECTOR_.jpg", "name": "Lee chettoe", "role": "Managing Director", "desc": "Meet Lee Chettoe, our Managing Director here at LPC Invest. Lee brings a wealth of experience and knowledge to the team here. He has been involved in the Property Investment industry at many levels for many years. His commitment and collection of exceptional skills have earned him a reputation for his successes and accomplishments. Due to his roots being in Manchester, Lee has a wide range of extensive knowledge surrounding the property market found in the city, as well as its ever-changing nature.", "mobile": ".", "email": "Lee .@lpcinvest.com", "address": "Arrive, White Media City UK, Salford, M50 2NT"}}]